
import pandas as pd
from  .Questionnaire import Questionnaire

class BeckDepression(Questionnaire):
	"""
	A class used to represent an the Beck Depression Questionnaire

	Attributes
	----------
	df : DataFrame
		A Pandas data frame with the specific columns
		for the questionnaire 

	Methods
	-------
	grade()
		Calculates the grading of the questionnaire.
		In this case the same values as the input (hours)

	"""
	def __init__(self, df):
		"""
		Init the following arguments: 
		names = the new columns' names (after grading)
		labels = labels for the columns to be written in the SPSS output file
		values = explanation for the value for SPSS columns - empty for this questionaire 
		code_dic = a dictionary from each sentence to a number

		Parameters
		----------
		df : DataFrame
			A Pandas data frame with the specific columns
			for the questionnaire
		"""
		Questionnaire.__init__(self, df)
		self.code_dic = beck_dep
		self.name = "BDI"
		self.labels = ["Beck depression questionnaire"]
		self.values = {'BDI' : {}}
	def grade(self):
		"""
		Grades the questionaire according to the questionaire grading rules:
		summary of all the questions, after convertion each sentence to number
				
		Returns
		----------
		DataFrame
			a new DataFrame with the new columns after grading
		"""
		beck_df =  pd.DataFrame(index=self.df.index,columns=self.df.columns)
		for i in range(self.df.shape[0]):
			for j in range(self.df.shape[1]):
				beck_df.iloc[i,j] = self.code_dic[self.df.iloc[i,j].strip()]
		new_series = beck_df.sum(axis=1)
		new_series.name = self.name
		return new_series
		
				
beck_dep = {
			'איני מרגיש\ה עצוב\ה' : 0,
			'אני עצוב\ה' : 1,
			'אני עצוב\ה כל הזמן ואינני יכול\ה לצאת מזה' : 2,
			'אני כה עצוב\ה או אומללה עד כי אינני יכול\ה לשאת זאת' : 3,
			'איני מיואש\ת במיוחד ביחס לעתיד' : 0,
			'אני מיואש\ת לגבי העתיד' : 1,
			'אני חש\ה שאין לי למה לצפות' : 2,
			'אני מרגיש\ה שהעתיד הוא חסר תקווה ושהדברים לא יכולים להשתפר' : 3,
			'איני מרגיש\ה ככשלון' : 0,
			'אני מרגיש\ה שנכשלתי יותר מהאדם הממוצע' : 1,
			'בהיבטי לאחור על חיי כל מה שאני רואה הוא כשלונות רבים' : 2,
			'אני מרגיש\ה שאני כשלון גמור כאדם' : 3,
			'אני מפיק\ה את אותה ההנאה מדברים' : 0,
			'איני נהנה\ית מדברים כפי שנהניתי' : 1,
			'איני מקבל\ת יותר סיפוק משום דבר' : 2,
			'אני בלתי מרוצה או משועמם\מת מכל דבר' : 3,
			'איני חש\ה אשם\ה במיוחד' : 0,
			'אני חש\ה אשם\ה חלק גדול מהזמן' : 1,
			'אני מרגיש\ה אשם\ה רוב הזמן' : 2,
			'אני חש\ה אשם\ה כל הזמן' : 3,
			'איני חש\ה את עצמי מוענש\ת' : 0,
			'אני מרגיש\ה שאני עלול\ה להיענש' : 1,
			'אני צופה להענש' : 2,
			'אני חש\ה שאני מוענש\ת' : 3,
			'אינני מאוכזב\ת מעצמי' : 0,
			'אני מאוכזב\ת מעצמי' : 1,
			'אני נגעל\ת מעצמי' : 2,
			'אני שונא\ת את עצמי' : 3,
			'איני מרגיש\ה שאני רע\ה יותר מאדם אחר' : 0,
			'אני ביקורתי\ת מאוד ביחס לעצמי בשל החולשות והשגיאות שלי' : 1,
			'אני מאשימ\ה את עצמי כל הזמן על חסרונותיי' : 2,
			'אני מאשים\מה את עצמי על כל דבר רע שקורה' : 3,
			'אין לי כלל מחשבות להרוג את עצמי' : 0,
			'יש לי מחשבות להרוג את עצמי, אך לא אבצע אותן' : 1,
			'הייתי רוצה להרוג את עצמי' : 2,
			'הייתי הורגת את עצמי אילו הייתה לי הזדמנות' : 3,
			'איני בוכה יותר מהרגיל' : 0,
			'אני בוכה עכשיו יותר מאשר בעבר' : 1,
			'אני בוכה כל הזמן עכשיו' : 2,
			'בעבר יכולתי לבכות, אולם עכשיו איני יכול\ה לבכות אפילו שאני רוצה בכך' : 3,
			'אני לא מרוגז\ת עכשיו יותר מאשר בדרך כלל' : 0,
			'אני מתרגז\ת ביתר קלות מאשר בעבר' : 1,
			'אני מתרגז\ת כל הזמן' : 2,
			'איני מתרגז\ת בכלל בשל דברים אשר הרגיזו אותי בעבר' : 3,
			'לא איבדתי עניין באנשים אחרים' : 0,
			'אני מתעניינ\ת עכשיו באנשים פחות מאשר בעבר' : 1,
			'איבדתי את רוב התעניינותי באנשים' : 2,
			'איבדתי כל עניין באנשים' : 3,
			'אני מגיע\ה להחלטות כמו תמיד' : 0,
			'אני משתדל\ת לדחות החלטות יותר משעשיתי זאת בעבר' : 1,
			'אני מתקשה להגיע להחלטות יותר מבעבר' : 2,
			'איני יכול\ה להגיע להחלטות בכלל' : 3,
			'אני לא מרגיש\ה שאני נראה\ית מבוגר\ת יותר מאשר נראיתי בעבר' : 0,
			'אני מודאג\ת מכך שאני נראה\ית מבוגר\ת מכפי גילי או בלתי מושך\ת' : 1,
			'אני  מרגיש\ה שחלים שינויים בהופעתי ושהם גורמים לי להרגיש בלתי מושך\ת' : 2,
			'אני מרגיש\ה שאני מכוער\ת' : 3,
			'אני יכול\ה לעבוד כמו בעבר' : 0,
			'נדרש ממני מאמץ מיוחד כדי להתחיל לעשות משהו' : 1,
			'עליי לדחוף את עצמי מאוד כדי להתחיל לעשות משהו' : 2,
			'אני לא מסוגל\ת לעבוד בכלל' : 3,
			'אני יכול\ה לישון כרגיל' : 0,
			'איני ישן\ה טוב כבעבר' : 1,
			'אני מתעורר\ת בשעה שעתיים מוקדם מהרגיל ומתקשה להרדם שוב' : 2,
			'אני מתעורר\ת מספר שעות מוקדם יותר מבעבר ואיני יכול\ה להירדם שוב' : 3,
			'איני מתעייף\ת ביתר קלות מאשר בעבר' : 0,
			'אני מתעייף\ת ביתר קלות מאשר בעבר' : 1,
			'אני מתעייף\ת מאי עשית כמעט מאומה' : 2,
			'אני עייף\ה מדי מכדי שאוכל לעשות משהו' : 3,
			'תיאבוני אינו גרוע מהרגיל' : 0,
			'תיאבוני אינו טוב כפי שהיה' : 1,
			'תיאבוני הרבה יותר גרוע עכשיו' : 2,
			'אין לי תיאבון כלל' : 3,
			'לא הפסדתי הרבה ממשקלי, אם בכלל, לאחרונה' : 0,
			'לאחרונה הפסדתי למעלה מ2.5 ק"ג ממשקלי' : 1,
			'לאחרונה הפסדתי למעלה מ5 ק"ג ממשקלי' : 2,
			'לאחרונה הפסדתי למעלה מ7.5 ק"ג ממשקלי' : 3,
			'אני לא מודאגת מבריאותי יותר מהרגיל' : 0,
			'אני מוטרד\ת מבעיות גופניות כגון: מיחושים וכאבים, קיבה לא סדירה או עצירות' : 1,
			'אני מוטרד\ת בעיות גופניות וקשה לי לחשוב על משהו אחר' : 2,
			'אני כה מוטרד\ת מבעיות גופניות שאני לא מסוגל\ת לחשוב על דבר מה אחר' : 3,
			'לא הבחנתי בשינוי כלשהו בהתעניינותי במין לאחרונה' : 0,
			'אני פחות מעוניינ\ת במין כבעבר' : 1,
			'אני הרבה פחות מעוניינ\ת במין עכשיו' : 2,
			'איבדתי לחלוטין כל עניין במין' : 3
			}
	